STUDI KASUS:
Buatlah 5 baris tabel dengan kolom nomor, nama, usia, berat badan dan tanggal. Kolom nomor dan tanggal default, kolom nama, usia dan berat badan diisi urut antara 20kg-60kg.
Tipe data yang digunakan adalah int untuk nomor dan usia, string untuk nama, date untuk tanggal serta float untuk berat badan.  
Lakukan seleksi column untuk menampilkan column dengan tipe data Float, lalu tampilkan pernyataan True untuk berat badan dibawah 50, dan false untuk berat badan diatas 50kg.

In [1]:
#import modules

import pandas as pd
import numpy as np

In [6]:
n_rows = 5
n_cols = 5

data = {'berat badan': ['20','30','40','50','60'],
        'usia': ['19','20','21','22','23'],
        'nama': ['Aliyah','Binta','Cecil','Diandra','Emma']}

df = pd.DataFrame(data)
df

df.index = pd.util.testing.makeDateIndex(n_rows, name='tanggal', freq='Y')
df_date = df.reset_index().loc[:, ::-1]
df_date

      nama usia berat badan    tanggal
0   Aliyah   19          20 2000-12-31
1    Binta   20          30 2001-12-31
2    Cecil   21          40 2002-12-31
3  Diandra   22          50 2003-12-31
4     Emma   23          60 2004-12-31

In [3]:
df_x = df_date.astype({'nama': 'string','usia': 'int','berat badan': 'float'})
df_x

      nama  usia  berat badan    tanggal
0   Aliyah    19         20.0 2000-12-31
1    Binta    20         30.0 2001-12-31
2    Cecil    21         40.0 2002-12-31
3  Diandra    22         50.0 2003-12-31
4     Emma    23         60.0 2004-12-31

In [4]:
df_x.dtypes

nama                   string
usia                    int32
berat badan           float64
tanggal        datetime64[ns]
dtype: object

In [5]:
df_x.select_dtypes(include='float')
df_x[~df_x['berat badan'].isin([50, 60])]

     nama  usia  berat badan    tanggal
0  Aliyah    19         20.0 2000-12-31
1   Binta    20         30.0 2001-12-31
2   Cecil    21         40.0 2002-12-31